app/views/comments/_comment.html.erb

Posted <%= time_ago_in_words(comment.created_at) %> ago. |
By <%= (User.find_by_id(comment.user_id)).name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1