app/views/microposts/postshow.html.erb

		<p>BY:  <%= micropost.user %>
		<p>Comments(<%= micropost.comments.count %>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 1]]