app/views/microposts/trending.erb

		<p>BY:  <%= micropost.user.name.inspect%>
		<p>Comments(<%= micropost.comments.count %>)
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 2]]