app/controllers/comments_controller.rb

def create
    @micropost = Micropost.find(params[:micropost_id])
    @comment = Comment.new(params[:comment])
    @comment.micropost = @micropost
    @comment.user = current_user

    if @comment.save
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("comment", "created_at", "micropost_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "good"], ["created_at", Tue, 18 Mar 2014 10:35:11 UTC +00:00], ["micropost_id", 1], ["updated_at", Tue, 18 Mar 2014 10:35:11 UTC +00:00], ["user_id", 1]]