app/controllers/microposts_controller.rb

  def postshow
   @microposts = Micropost.all
   @microposts = Micropost.paginate(:page => params[:page], :per_page => 5)
---
SELECT "microposts".* FROM "microposts" ORDER BY microposts.created_at DESC LIMIT 5 OFFSET 0

def trending
   @microposts = Micropost.all
   @microposts = Micropost.paginate(:page => params[:page], :per_page => 5)
---
SELECT "microposts".* FROM "microposts" ORDER BY microposts.created_at DESC LIMIT 5 OFFSET 0

  def create
  unless signed_in?
    @micropost = Micropost.new
  else
        @user = User.new(params[:user])
        @micropost = current_user.microposts.build(params[:micropost])

#   @micropost = current_user.microposts.new(params[:micropost])
  end

      if @micropost.save
---
INSERT INTO "microposts" ("created_at", "post", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Tue, 18 Mar 2014 10:34:40 UTC +00:00], ["post", "Hi \r\nthis is my post no one just for checking."], ["updated_at", Tue, 18 Mar 2014 10:34:40 UTC +00:00], ["user_id", 1]]

  def show
  @micropost = Micropost.find(params[:id])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "1"]]